src/cf/DataProcessors/ОплатаСервисаУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОплатаСервисаУНФ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/СвязьАбонентСервисаОрганизация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СвязьАбонентСервисаОрганизация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодАбонента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ОплатаСервисаУНФ/Forms/НастройкаОплатыСервиса/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДоступныхАбонентов();
	ПрочитатьНастройкиСвязей();
	
	Элементы.НастройкиОплатыСервиса.Доступность = НаборКонстант.ИспользоватьОплатуСервиса;
	
	Настройки = ОплатаСервисаУНФ.НастройкиОплатыСервиса();
	
	ГруппаНоменклатурыТарифовСервиса = Настройки.ГруппаНоменклатурыТарифовСервиса;
	ОформляемыйДокумент = Настройки.ОформляемыйДокумент;
	ВидЗаказа = Настройки.ВидЗаказа;
	СостояниеЗаказа = Настройки.СостояниеЗаказа;

	Элементы.ГруппаНастройкиЗаказа.Доступность = (ОформляемыйДокумент = "ЗаказПокупателя");
	ЗаполнитьКомандыПечати();
	ОтправляемаяПечатнаяФорма = Настройки.ОтправляемаяПечатнаяФорма;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройкиСвязей();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьОплатуСервисаПриИзменении(Элемент)
	
	ПриИзмененииРеквизита(Элемент);
	Элементы.НастройкиОплатыСервиса.Доступность = НаборКонстант.ИспользоватьОплатуСервиса;
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаНоменклатурыТарифовСервисаПриИзменении(Элемент)
	
	СохранитьНастройкиОплаты();
	
КонецПроцедуры           

&НаКлиенте
Процедура ОформляемыйДокументЗаказПриИзменении(Элемент)
	
	ПриИзмененииОформляемогоДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаказаПриИзменении(Элемент)
	
	СохранитьНастройкиОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаказаПриИзменении(Элемент)
	
	СохранитьНастройкиОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОформляемыйДокументСчетПриИзменении(Элемент)
	
	ПриИзмененииОформляемогоДокумента();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтправляемаяПечатнаяФормаПриИзменении(Элемент)

	СохранитьНастройкиОплаты();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкиОплатыСервиса(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму(
		"Обработка.ПанельАдминистрированияБТС.Форма.НастройкиОплатыСервиса", ПараметрыФормы,ЭтотОбъект, , , , , 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТарифыСервиса(Команда)
	
	ДлительнаяОперация = НачатьЗагрузкуТарифовСервиса();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииЗагрузкиТарифов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НачатьЗагрузкуТарифовСервиса()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "ОплатаСервиса.ЗагрузитьТарифыСервиса");
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииЗагрузкиТарифов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Загрузка выполнена'"), , 
		НСтр("ru = 'Загрузка тарифов сервиса выполнена.'"), БиблиотекаКартинок.Информация);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОплаты()
	
	Настройки = ОплатаСервисаУНФ.НастройкиОплатыСервиса();
	Настройки.ГруппаНоменклатурыТарифовСервиса = ГруппаНоменклатурыТарифовСервиса; 
	Настройки.ОтправляемаяПечатнаяФорма = ОтправляемаяПечатнаяФорма;
	Настройки.ОформляемыйДокумент = ОформляемыйДокумент;
	Настройки.ВидЗаказа = ВидЗаказа;
	Настройки.СостояниеЗаказа = СостояниеЗаказа;
	
	ОплатаСервисаУНФ.СохранитьНастройкиОплатыСервиса(Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизита(Элемент)
	
	ИменаКонстант = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	ОбновитьПовторноИспользуемыеЗначения();
	
	Для Каждого ИмяКонстанты Из ИменаКонстант Цикл
		Если ИмяКонстанты <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, ИмяКонстанты);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	ИменаКонстант = Новый Массив;
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	НачатьТранзакцию();

	Попытка
		ИмяКонстанты = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
		ИменаКонстант.Добавить(ИмяКонстанты);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат ИменаКонстант;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	ЧастиИмени = СтрРазделить(РеквизитПутьКДанным, ".");
	Если ЧастиИмени.Количество() <> 2 Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяКонстанты = ЧастиИмени[1];
	КонстантаМенеджер = Константы[ИмяКонстанты];
	КонстантаЗначение = НаборКонстант[ИмяКонстанты];
	ТекущееЗначение  = КонстантаМенеджер.Получить();
	Если ТекущееЗначение <> КонстантаЗначение Тогда
		Попытка
			КонстантаМенеджер.Установить(КонстантаЗначение);
		Исключение
			НаборКонстант[ИмяКонстанты] = ТекущееЗначение;
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;
	
	Возврат ИмяКонстанты;
	
КонецФункции

&НаСервере
Процедура ПриИзмененииОформляемогоДокумента()
	
	Элементы.ГруппаНастройкиЗаказа.Доступность = (ОформляемыйДокумент = "ЗаказПокупателя");
	ЗаполнитьКомандыПечати();
	СохранитьНастройкиОплаты();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомандыПечати()
	
	СписокВыбораФормы = Элементы.ОтправляемаяПечатнаяФорма.СписокВыбора;
	КомандыПечатиЗаказа = УправлениеПечатью.КомандыПечатиФормы(СтрШаблон("Документ.%1.Форма.ФормаСписка", ОформляемыйДокумент));
	
	СписокВыбораФормы.Очистить();
	Для Каждого Строка Из КомандыПечатиЗаказа Цикл 
		
		// Нужно исключить из списка формы офисных документов. 
		Если Строка.Идентификатор = "Конверт" Или СтрНайти(Строка.Идентификатор, "ПечатьПоШаблонуОфисногоДокумента") = 1 Тогда
			Продолжить;
		КонецЕсли;
		СписокВыбораФормы.Добавить(Строка.Идентификатор, Строка.Представление,, Строка.Картинка);
	КонецЦикла;
		
	Если СписокВыбораФормы.НайтиПоЗначению(ОтправляемаяПечатнаяФорма) = Неопределено Тогда 
        ОтправляемаяПечатнаяФорма = Неопределено;
		Если СписокВыбораФормы.Количество() > 0 Тогда
			ОтправляемаяПечатнаяФорма = Элементы.ОтправляемаяПечатнаяФорма.СписокВыбора[0].Значение;
		КонецЕсли;
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныхАбонентов()
	
	ДоступныеАбоненты = ПрограммныйИнтерфейсСервиса.Абоненты();
	Для каждого Абонент Из ДоступныеАбоненты Цикл
		НоваяСтрока = СвязьКодаАбонентаСправочникОрганизации.Добавить();
		НоваяСтрока.КодАбонента = Абонент.Код;
		НоваяСтрока.ПредставлениеАбонента = Абонент.Наименование;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиСвязей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязьАбонентСервисаОрганизация.КодАбонента КАК КодАбонента,
	|	СвязьАбонентСервисаОрганизация.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.СвязьАбонентСервисаОрганизация КАК СвязьАбонентСервисаОрганизация";
	СвязьОрганизацияАбонент = Запрос.Выполнить().Выбрать();
	Пока СвязьОрганизацияАбонент.Следующий() Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("КодАбонента", СвязьОрганизацияАбонент.КодАбонента);
		Строки = СвязьКодаАбонентаСправочникОрганизации.НайтиСтроки(ПараметрыОтбора);
		Для каждого Строка Из Строки Цикл
			Строка.Организация = СвязьОрганизацияАбонент.Организация;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиСвязей()
	
	СвязьОрганизацияАбонент = РегистрыСведений.СвязьАбонентСервисаОрганизация.СоздатьНаборЗаписей();
	Для каждого Связь Из СвязьКодаАбонентаСправочникОрганизации Цикл
		Если ЗначениеЗаполнено(Связь.Организация) Тогда
			НоваяСтрока = СвязьОрганизацияАбонент.Добавить();
			НоваяСтрока.КодАбонента = Связь.КодАбонента;
			НоваяСтрока.Организация = Связь.Организация;
		КонецЕсли;
	КонецЦикла;
	СвязьОрганизацияАбонент.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
